In [17]:
import sqlite3
conn=sqlite3.connect('exp2.db');
cur=conn.cursor()
print("Opened database successfully");

Opened database successfully

In [21]:
conn.execute('''CREATE TABLE COMPANY1(ID INT PRIMARY KEY NOT NULL, NAME TEXT NOT NULL, AGE INT NOT NULL, ADDRESS CHER(50), SALARY REAL);''')
print("Table created sucessfully");

Table created sucessfully

In [22]:
conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES(1, 'Paul', 32, 'California', 20000.00)");
conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES(2, 'Allen', 25, 'Texas', 15000.00)");
conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES(3, 'Teddy', 23, 'Norway', 20000.00)");
conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) VALUES(4, 'Mark', 25, 'Rich-Mond', 65000.00)");
conn.commit()
print("Records created successfully");

Records created successfully

In [23]:
for row in conn.execute('select * from COMPANY1'):
        print(row)

(1, 'Paul', 32, 'California', 20000.0)
(2, 'Allen', 25, 'Texas', 15000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(4, 'Mark', 25, 'Rich-Mond', 65000.0)

In [20]:
conn.commit()

In [ ]:
conn.close()